"use strict";
// let animals = ["cat","dog","rabbit","bird","fish"];
// let i = Math.floor(Math.random()*animals.length);
// let animalsRandom = animals[i];
// let userAnimal = prompt('Введите животное (cat dog rabbit bird fish)');
//
// userAnimal===animalsRandom ? alert('Молодец') : alert('Лузер!');
//
// // if (userAnimal===animalsRandom){
// //     alert('Молодец')
// // }
// // else {
// //     alert('Лузер!');
// // }
// console.log(animalsRandom);
//
// let quotes = ['Почніть робити те, що потрібно. Потім робіть те, що можливо. І ви раптом виявите, що робите неможливе. – Св.Франциск Асізський','Ніщо не є більш обтяжливим для мудрої людини і ніщо не доставляє йому більшого занепокоєння, ніж необхідність витрачати на дрібниці і непотрібні речі більше часу, ніж вони того заслуговують. – Платон', 'Кращий спосіб почати робити – перестати говорити і почати робити. – Уолт Дісней', 'Ваш час обмежений, не витрачайте його, проживаючи чуже життя. Не попадайтеся на гачок віровчення, яке існує на уявленнях інших людей. Не дозволяйте поглядам інших заглушати свій власний внутрішній голос. І дуже важливо мати мужність слідувати своєму серцю та інтуїції. Вони, так чи інакше, вже знають, що ви дійсно хочете зробити. Все інше – другорядне. – Стів Джобс','Ваш мозок може все. Абсолютно все. Головне, переконати себе в цьому. Руки не знають, що вони не вміють віджиматися, ноги не знають, що вони слабкі. Це знає ваш мозок. Переконавши себе в тому, що ви можете все, ви зможете дійсно все. – Роберт Кіосакі', 'Ви отримуєте від життя лише те, що наважуєтеся попросити. Не бійтеся підвищувати планку. – Опра Уїнфрі', 'Щаслива людина занадто задоволена сьогоденням, щоб занадто багато думати про майбутнє. – Альберт Эйнштейн','Іноді щось може йти не так, як хотілося-б, але ви не повинні зупинятися. – Майкл Джордан','Будь собою, інші ролі зайняті. – Оскар Уайльд'];
//
// alert(quotes[Math.floor(Math.random()*quotes.length)]);

// let a = 5;
// while (a < 7) {
//     console.log(a);
//     a++;
// }

// let arr = [2,5,'d'];
// for (let i = 0, max = arr.length; i < max; i++) {
//     console.log(arr[i]);
// }

// for (let i = 2; i <= 10; i += 2){
//     console.log(i);
// }
// console.log('____________');
for (let i = 0; i <= 10; i++){
    if (i % 2 !== 0) {
        continue
    }
    console.log(i);
}


